In [1]:
li=['1','2','5','0','9']
# li.sort(reverse=True)
# li

In [2]:
modifiedli=list(map(int,li))
modifiedli

[1, 2, 5, 0, 9]

In [13]:
import numpy as np
import pandas as pd
a={'A':[1,2,3,4],
   'B':[5,6,7,8],
   'C':[9,10,1,2],
   'D':[2,4,8,6]}

b={'A':[10],'B':[20],'C':[50],'D':[90]}

c={'A':[100,200,300,400],
   'B':[500,600,700,800],
   'C':[900,1000,100,200],
   'D':[200,400,800,600]
  }

In [14]:
df1=pd.DataFrame(a)
df1

   A  B   C  D
0  1  5   9  2
1  2  6  10  4
2  3  7   1  8
3  4  8   2  6

In [18]:
df2=pd.DataFrame(b,index=[4])
df2

    A   B   C   D
4  10  20  50  90

In [21]:
df3=pd.DataFrame(c)
df3

     A    B     C    D
0  100  500   900  200
1  200  600  1000  400
2  300  700   100  800
3  400  800   200  600

In [22]:
df4=pd.concat([df1,df2,df3])
df4

     A    B     C    D
0    1    5     9    2
1    2    6    10    4
2    3    7     1    8
3    4    8     2    6
4   10   20    50   90
0  100  500   900  200
1  200  600  1000  400
2  300  700   100  800
3  400  800   200  600

In [23]:
lst=[[1,2],[1,2],[2,3]]
df=pd.DataFrame(lst)
df

   0  1
0  1  2
1  1  2
2  2  3

In [31]:
li=[[9,8]]
df8=pd.DataFrame(li,index=[4])

In [32]:
df5=pd.concat([df,df8])
df5

   0  1
0  1  2
1  1  2
2  2  3
4  9  8